:MONITORCLIENT
{
	ConnectIP = "127.0.0.1"	// ConnectIP
	Port = 18245		// Port	
	CreateWorker = 4		// 생성 워커 스레드
	ActiveWorker = 2		// 활성화 워커스레드
	HeadCode = 119		// 헤더 코드
	XorCode1 = 50		// XorCode 1번
	XorCode2 = 132		// XorCode 2번
	Nodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
	LogLevel	= 0		// 0 : 디버그 / 1 : 위험 / 2 : 에러 / 3 :  시스템
	LoginKey = "P09djiwl34jWJV%@oW@#o0d82jvk#cjz" // 모니터링 서버에 들고가는 키
}

:MONITOR1
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 1		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 10		// 모니터 윈도우의 위치 X
	PosY = 10		// 모니터 윈도우의 위치 Y
	Width = 500		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "송진규 서버 CPU"	// 캡션바 텍스트
	Unit = "%"		// 캡션바에 표시될 단위
	Red = 62			// 배경 RGB 컬러
	Green = 62
	Blue = 62
	GraphMaxValue = 100
	AlarmValue = 90
	ServerNo1 = 2	
	ColumText1 = "CPU 사용량"
}

:MONITOR2
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 2		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 520		// 모니터 윈도우의 위치 X
	PosY = 10		// 모니터 윈도우의 위치 Y
	Width = 400		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "서버 사용 가능 메모리"	// 캡션바 텍스트
	Unit = "MB"		// 캡션바에 표시될 단위
	Red = 62			// 배경 RGB 컬러
	Green = 62
	Blue = 62
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 2		
	ColumText1 = "서버 사용 가능 메모리"
}

:MONITOR3
{
	DataTypeCount = 2	// 데이터 타입의 수
	DataType1 = 3		// 데이터 타입 및 배열의 순서
	DataType2 = 4		// 데이터 타입 및 배열의 순서
	GraphType = 5		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 930		// 모니터 윈도우의 위치 X
	PosY = 10		// 모니터 윈도우의 위치 Y
	Width = 510		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "Network"	// 캡션바 텍스트
	Unit = "KByte"		// 캡션바에 표시될 단위
	Red = 62			// 배경 RGB 컬러
	Green = 62
	Blue = 62
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 2
	ServerNo2 = 2
	ColumText1 = "Recv"
	ColumText2 = "Send"
}

:MONITOR5
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 5		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 1450		// 모니터 윈도우의 위치 X
	PosY = 10		// 모니터 윈도우의 위치 Y
	Width = 460		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "Nonpaged Mem"	// 캡션바 텍스트
	Unit = "MB"		// 캡션바에 표시될 단위
	Red = 62			// 배경 RGB 컬러
	Green = 62
	Blue = 62
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 2	
	ColumText1 = "Nonpaged Mem"
}



:MONITOR36
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 36		// 데이터 타입 및 배열의 순서
	GraphType = 7		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 10		// 모니터 윈도우의 위치 X
	PosY = 150		// 모니터 윈도우의 위치 Y
	Width = 150		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "채팅 서버 On/Off"	// 캡션바 텍스트
	Unit = "NULL"		// 캡션바에 표시될 단위
	Red = 18			// 배경 RGB 컬러
	Green = 52
	Blue = 120
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 3	
	ColumText1 = "채팅 서버 On/Off"
}

:MONITOR37
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 37		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 170		// 모니터 윈도우의 위치 X
	PosY = 150		// 모니터 윈도우의 위치 Y
	Width = 200		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "채팅 서버 CPU"	// 캡션바 텍스트
	Unit = "%"		// 캡션바에 표시될 단위
	Red = 18			// 배경 RGB 컬러
	Green = 52
	Blue = 120
	GraphMaxValue = 100
	AlarmValue = 90
	ServerNo1 = 3	
	ColumText1 = "채팅 서버 CPU"
}

:MONITOR38
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 38		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 380		// 모니터 윈도우의 위치 X
	PosY = 150		// 모니터 윈도우의 위치 Y
	Width = 200		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "채팅 서버 메모리"	// 캡션바 텍스트
	Unit = "MB"		// 캡션바에 표시될 단위
	Red = 18			// 배경 RGB 컬러
	Green = 52
	Blue = 120
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 3	
	ColumText1 = "채팅 서버 메모리"
}

:MONITOR39
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 39		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 590		// 모니터 윈도우의 위치 X
	PosY = 150		// 모니터 윈도우의 위치 Y
	Width = 200		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "Packet Pool"	// 캡션바 텍스트
	Unit = "NULL"		// 캡션바에 표시될 단위
	Red = 18			// 배경 RGB 컬러
	Green = 52
	Blue = 120
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 3	
	ColumText1 = "Packet Pool"
}

:MONITOR40
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 40		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 1110		// 모니터 윈도우의 위치 X
	PosY = 150		// 모니터 윈도우의 위치 Y
	Width = 200		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "Sessian All"	// 캡션바 텍스트
	Unit = "NULL"		// 캡션바에 표시될 단위
	Red = 18			// 배경 RGB 컬러
	Green = 52
	Blue = 120
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 3	
	ColumText1 = "Sessian All"
}

:MONITOR41
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 41		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 1320		// 모니터 윈도우의 위치 X
	PosY = 150		// 모니터 윈도우의 위치 Y
	Width = 300		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "Login Player"	// 캡션바 텍스트
	Unit = "NULL"		// 캡션바에 표시될 단위
	Red = 18			// 배경 RGB 컬러
	Green = 52
	Blue = 120
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 3	
	ColumText1 = "Login Player"
}

:MONITOR42
{
	DataTypeCount = 1	// 데이터 타입의 수
	DataType1 = 42		// 데이터 타입 및 배열의 순서
	GraphType = 4		//  0 : BAR_SINGLE_VERT, 1 : BAR_SINGLE_HORZ, 2 : BAR_COLUMN_VERT, 3 : BAR_COLUMN_HORZ, 4 : LINE_SINGLE, 5 : LINE_MULTI, 6 : PIE, 7 : ONOFF
	PosX = 1630		// 모니터 윈도우의 위치 X
	PosY = 150		// 모니터 윈도우의 위치 Y
	Width = 280		// 모니터 윈도우의 넓이
	Height = 130		// 모니터 윈도우의 높이
	CaptionText = "Room"	// 캡션바 텍스트
	Unit = "NULL"		// 캡션바에 표시될 단위
	Red = 18			// 배경 RGB 컬러
	Green = 52
	Blue = 120
	GraphMaxValue = 0
	AlarmValue = 0
	ServerNo1 = 3	
	ColumText1 = "Room"
}


